tap "noobaa/noobaa"
tap "planetscale/tap"
tap "derailed/k9s"
{{ if eq .chezmoi.os "linux" -}}
brew "zsh"
{{ end -}}
{{ if has "hackintosh" .tags -}}
brew "python"
brew "python-tk"
cask "hackintool"
brew "sleepwatcher", restart_service: :changed
{{ end -}}
{{ if has "personal" .tags -}}
cask "steam"
cask "google-chrome"
cask "folding-at-home"
{{ end -}}
brew "antigen"
brew "git"
brew "htop"
brew "pv"
brew "jq"
brew "mas"
brew "noobaa"
brew "podman"
cask "podman-desktop"
brew "kubernetes-cli"
brew "krew"
brew "openshift-cli"
brew "k9s"
brew "dive"
brew "mysql"
brew "vitess"
brew "terminal-notifier"
brew "terraform"
cask "1password-cli"
cask "bluetility"
{{ if or (has "desktop" .tags) (has "laptop" .tags) -}}
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "1password"
cask "spectacle"
cask "caffeine"
cask "sourcetree"
{{ end -}}
