tap "derailed/k9s"
tap "noobaa/noobaa"
tap "planetscale/tap"
tap "microsoft/mssql-release", "https://github.com/Microsoft/homebrew-mssql-release"

# Requirements for linux
{{ if eq .chezmoi.os "linux" -}}
brew "zsh"
{{ end -}}

# Brew/Bundle requirements
{{ if and (or (has "desktop" .tags) (has "laptop" .tags)) (eq .chezmoi.os "darwin") -}}
brew "mas"
{{ end -}}

# Hackintosh only recipies
{{ if has "hackintosh" .tags -}}
brew "python"
brew "python-tk"
cask "hackintool"
{{ end -}}

# Personal only recepies
{{ if has "personal" .tags -}}
brew "openshift-cli"
brew "tailscale"
cask "folding-at-home"
cask "google-chrome"
cask "steam"
{{ end -}}

# Non-server only recepies
{{ if or (has "desktop" .tags) (has "laptop" .tags) -}}
brew "sleepwatcher", restart_service: :changed
cask "1password"
cask "caffeine"
cask "devtoys"
cask "expandrive"
cask "jetbrains-toolbox"
cask "notion"
cask "podman-desktop"
cask "sourcetree"
cask "spectacle"
cask "visual-studio-code"
mas "Clocker", id: 1056643111
{{ end -}}


# Work only recepies
{{ if has "work" .tags -}}
brew "mssql-tools"
cask "adobe-acrobat-reader"
cask "dbeaver-community"
cask "manictime"
cask "microsoft-outlook"
{{ end -}}


# Installed on all dimensions
brew "antigen"
brew "antidote"
brew "azure-cli"
brew "direnv"
brew "diskonaut"
brew "dive"
brew "git"
brew "htop"
brew "jq"
brew "k9s"
brew "krew"
brew "kubernetes-cli"
brew "mas"
brew "mysql"
brew "node"
brew "noobaa"
brew "podman"
brew "pv"
brew "terminal-notifier"
brew "terraform"
brew "vitess"
cask "1password-cli"
cask "bluetility"
cask "git-credential-manager"
